---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail
source: html/c6900367-d935-4f51-74e9-402504e0baed.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailLevelOfDetail

Describes the level of detail in which the Bending Detail will be represented.

## Syntax (C#)
```csharp
public enum BendingDetailLevelOfDetail
```